In [2]:
import pandas as pd

## Reading from a CSV File

In [23]:
weather = pd.read_csv("weather.csv", parse_dates=["date"])
weather

           date  precipitation  temp_max  temp_min  wind  weather
0    2012-01-01            0.0      12.8       5.0   4.7  drizzle
1    2012-01-02           10.9      10.6       2.8   4.5     rain
2    2012-01-03            0.8      11.7       7.2   2.3     rain
3    2012-01-04           20.3      12.2       5.6   4.7     rain
4    2012-01-05            1.3       8.9       2.8   6.1     rain
...         ...            ...       ...       ...   ...      ...
1456 2015-12-27            8.6       4.4       1.7   2.9     rain
1457 2015-12-28            1.5       5.0       1.7   1.3     rain
1458 2015-12-29            0.0       7.2       0.6   2.6      fog
1459 2015-12-30            0.0       5.6      -1.0   3.4      sun
1460 2015-12-31            0.0       5.6      -2.1   3.5      sun

[1461 rows x 6 columns]

Get column types:

In [24]:
weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1461 entries, 0 to 1460
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           1461 non-null   datetime64[ns]
 1   precipitation  1461 non-null   float64
 2   temp_max       1461 non-null   float64
 3   temp_min       1461 non-null   float64
 4   wind           1461 non-null   float64
 5   weather        1461 non-null   object
dtypes: datetime64[ns](1), float64(4), object(1)
memory usage: 68.6+ KB

## Reading from a JSON File

In [37]:
football = pd.read_json("matches.json")
football

,date,team1,team2,score_team1,score_team2,group
0,2010-07-17,Kapfenberger SV,FC RB Salzburg,0,0,
1,2010-07-17,SC Wiener Neustadt,LASK Linz,5,0,
2,2010-07-17,SV Ried,SK Sturm Graz,0,3,
3,2010-07-18,FK Austria Wien,SV Mattersburg,2,0,
4,2010-07-18,FC Wacker Innsbruck,SK Rapid Wien,4,0,
...,...,...,...,...,...,...
34115,2018-05-18,Spezia,Parma,0,2,
34116,2018-05-18,Empoli,AC Perugia,2,1,
34117,2018-05-18,Venezia,Pescara,0,0,
34118,2018-05-18,Cittadella,Pro Vercelli,2,0,
34119,2018-05-18,Novara,Virtus Entella,0,1,

## Reading from an SQL Database

In [26]:
from sqlite3 import connect
from lab import create_sample_sql_table

connection = connect(":memory:")
create_sample_sql_table("users", connection)

pd.read_sql('SELECT uid, name FROM users', connection)

   uid  name
0    0  Alex
1    1   Guy
2    2  Ravi
3    3  Rafa

## Analyzing Weather Data

Start by looking at basic statistical descriptors of the dataset:

In [27]:
weather.describe()

       precipitation     temp_max     temp_min         wind
count    1461.000000  1461.000000  1461.000000  1461.000000
mean        3.029432    16.439083     8.234771     3.241136
std         6.680194     7.349758     5.023004     1.437825
min         0.000000    -1.600000    -7.100000     0.400000
25%         0.000000    10.600000     4.400000     2.200000
50%         0.000000    15.600000     8.300000     3.000000
75%         2.800000    22.200000    12.200000     4.000000
max        55.900000    35.600000    18.300000     9.500000

Find the day with the lowest min temperature

In [28]:
absolute_temp_min = weather.temp_min.min()
weather[weather.temp_min == absolute_temp_min]

          date  precipitation  temp_max  temp_min  wind weather
706 2013-12-07            0.0       0.0      -7.1   3.1     sun

Find the day with the highest max temperature

In [29]:
absolute_temp_max = weather.temp_max.max()
weather[weather.temp_max == absolute_temp_max]

          date  precipitation  temp_max  temp_min  wind weather
953 2014-08-11            0.5      35.6      17.8   2.6    rain

Are there any null values in the dataset?

In [30]:
weather.isnull().values.any()

False

We can also count null values

In [31]:
weather.isnull().sum()

date             0
precipitation    0
temp_max         0
temp_min         0
wind             0
weather          0
dtype: int64

## Analyzing Football Matches Data